Services/src/InformationRegisters/С_КурсыВалют/С_КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>С_КурсыВалют</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.С_Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Services/src/CommonModules/С_КурсыВалютСервер/Module.bsl
// Процедура для загрузки курсов валют по определенному периоду с помощью веб-сервисов НБ РБ.
//
// Параметры
// Валюты		- Любая коллекция - со следующими полями:
//					КодВалюты - числовой код валюты
//					Валюта - ссылка на валюту
// НачалоПериодаЗагрузки	- Дата - начало периода загрузки курсов
// ОкончаниеПериодаЗагрузки	- Дата - окончание периода загрузки курсов
//
// Возвращаемое значение:
// Массив состояния загрузки  - каждый элемент - структура с полями
//		Валюта - загружаемая валюта
//		СтатусОперации - завершилась ли загрузка успешно
//		Сообщение - пояснение о загрузке (текст сообщения об ошибке или поясняющее сообщение)
//
Процедура ПолучитьКурсы(ПараметрСписокВалют, ПараметрСписокДатЗагрузкиВалют,  ЗаписьТекст, КодОшибки, Отказ) Экспорт
	
	Попытка
		ВалютыТекст = СтрЗаменить(ПараметрСписокВалют, ";", Символы.ВК);
		КоличествоВалют = СтрЧислоСтрок(ВалютыТекст);
		Для сч = 0 по  КоличествоВалют - 1 Цикл
			
			КодВалюты = СтрПолучитьСтроку(ВалютыТекст, сч + 1);
			Кратность = 1;
			ВнутреннийКод = 0;
			
			ДатыТекст = СтрЗаменить(ПараметрСписокДатЗагрузкиВалют, ";", Символы.ВК);
			СтрокаДат = СтрПолучитьСтроку(ДатыТекст,сч + 1);
			НачалоПериодаЗагрузки    = Дата(Лев(СтрокаДат,8));
			ОкончаниеПериодаЗагрузки = Дата(Прав(СтрокаДат,8));
			С_КлассификаторВалютСервер.ЗаполнитьДанныеПоВалюте(КодВалюты, ВнутреннийКод, Кратность, ОкончаниеПериодаЗагрузки);
 			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	С_КурсыВалют.Валюта,
				|	С_КурсыВалют.Курс,
				|	С_КурсыВалют.Кратность,
				|	С_КурсыВалют.Период
				|ИЗ
				|	РегистрСведений.С_КурсыВалют КАК С_КурсыВалют
				|ГДЕ
				|	С_КурсыВалют.Период МЕЖДУ &Период1 И &Период2
				|	И С_КурсыВалют.Валюта.Код = &КодВалюты
				|
				|УПОРЯДОЧИТЬ ПО
				|	С_КурсыВалют.Период";
			
			Запрос.УстановитьПараметр("Период1", НачалоПериодаЗагрузки);
			Запрос.УстановитьПараметр("Период2", ОкончаниеПериодаЗагрузки);
			Запрос.УстановитьПараметр("КодВалюты", КодВалюты);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда
				ЗаписьТекст = ЗаписьТекст + "Cur_Date="+ Формат(Дата('19800101'),"ДФ=yyyy-MM-ddT00:00:00+03:00") + ";Cur_Code=" + КодВалюты 
				+";Cur_OfficialRate=" + 1
				+";Cur_Scale="+ 1 + Символы.ВК;
				Продолжить;
			КонецЕсли;
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				ЗаписьТекст = ЗаписьТекст + "Cur_Date="+ Формат(ВыборкаДетальныеЗаписи.период,"ДФ=yyyy-MM-ddT00:00:00+03:00") + ";Cur_Code=" + КодВалюты 
				+";Cur_OfficialRate=" + СтрЗаменить(ВыборкаДетальныеЗаписи.Курс, ",", ".")
				+";Cur_Scale="+ Кратность + Символы.ВК;
			КонецЦикла;             
			
		КонецЦИкла;
		ЗаписьТекст = СокрЛП(ЗаписьТекст);
	Исключение
		КодОшибки =  "CURR_RATES_ERROR";
		Отказ = Истина;
	КонецПопытки;	
	
КонецПроцедуры
